<details><summary>terraform plan:</summary>

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_team.admin will be updated in-place
  ~ resource "github_team" "admin" {
        create_default_maintainer = false
      + description               = "Admin"
        etag                      = "W/\"d6b76bb957f884c61410ee611bf2c66a7e0a93a23ba726891652f07d73566d1d\""
        id                        = "4697422"
        members_count             = 1
        name                      = "Admin"
        node_id                   = "MDQ6VGVhbTQ2OTc0MjI="
        privacy                   = "closed"
        slug                      = "admin"
    }

  # github_team.developer will be updated in-place
  ~ resource "github_team" "developer" {
        create_default_maintainer = false
      + description               = "developer"
        etag                      = "W/\"410365677613a525d3614091696cd409b82a7b265d508e1e1ac8b1b7d022f060\""
        id                        = "4709164"
        members_count             = 1
        name                      = "Developer"
        node_id                   = "MDQ6VGVhbTQ3MDkxNjQ="
        privacy                   = "closed"
        slug                      = "developer"
    }

  # github_team.readonly will be created
  + resource "github_team" "readonly" {
      + create_default_maintainer = false
      + description               = "readonly"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Readoly"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: "organization": [DEPRECATED] Use owner (or GITHUB_OWNER) instead of organization (or GITHUB_ORGANIZATION)


```

</details>